Repository: zmonx/flutter-promptpay-qr
Catalog: lib/l10n/app_*.arb
Languages: th

# appTitle
source: PromptPay QR Generator
th: สร้างคิวอาร์โค้ดพร้อมเพย์

# promptpayIdLabel
source: PromptPay ID (Phone or National ID)
th: รหัสพร้อมเพย์ (เบอร์โทรหรือเลขบัตรประชาชน)

# promptpayIdHint
source: Ex. 08xxxxxxxx
th: เช่น 08xxxxxxxx

# amountLabel
source: Amount (optional, à¸¿)
th: จำนวนเงิน (ไม่บังคับ, ฿)

# amountHint
source: Ex. 100.00
th: เช่น 100.00

# generateButton
source: Generate QR Code
th: สร้างคิวอาร์โค้ด

# validSlip
source: This slip appears to be a real PromptPay slip.
th: สลิปนี้เป็นสลิปพร้อมเพย์ที่ถูกต้อง

# invalidSlip
source: This slip does not appear to be a valid PromptPay slip.
th: สลิปนี้ไม่ใช่สลิปพร้อมเพย์ที่ถูกต้อง

# validSlipTitle
source: Valid PromptPay Slip
th: สลิปพร้อมเพย์ถูกต้อง

# invalidSlipTitle
source: Invalid Slip
th: สลิปไม่ถูกต้อง

source: Close
th: ปิด

source: Scan Slip QR
th: สแกนคิวอาร์สลิป

source: Check Slip
th: ตรวจสอบสลิป

source: QR Scan Result
th: ผลการสแกนคิวอาร์

source: Sender ID
th: ผู้โอน

source: Amount
th: จำนวนเงิน

source: Date
th: วันที่

source: Scan Again
th: สแกนอีกครั้ง

source: Cancel
th: ยกเลิก

source: Browse File
th: เลือกไฟล์
